skydivervrn/flysight-2-firmware/STM32_WPAN/App/app_ble.c
          /* USER CODE BEGIN EVT_LE_CONN_UPDATE_COMPLETE */

          /* USER CODE END EVT_LE_CONN_UPDATE_COMPLETE */
          break;

        case HCI_LE_ENHANCED_CONNECTION_COMPLETE_SUBEVT_CODE:
          p_enhanced_connection_complete_event = (hci_le_enhanced_connection_complete_event_rp0 *) p_meta_evt->data;
          /**
           * The connection is done, there is no need anymore to schedule the LP ADV
           */

          connection_handle = p_enhanced_connection_complete_event->Connection_Handle;
          role = p_enhanced_connection_complete_event->Role;

#if FS_BLE_DIAG
          /* Record 4, the first half — and the single most informative line in
           * the file for this bug. role=1 is us as PERIPHERAL, i.e. a phone or
           * the Mac got past the whitelist filter. peer_type 0x00/0x01 is a plain
           * public/random identity; 0x02/0x03 mean the controller RESOLVED the
           * peer's private address against the resolving list, so peer_addr is
           * the identity behind it and peer_rpa is what was actually on the air.
           * A phone that only ever gets in after a double-press should show
           * peer_type 0x01 with a peer_rpa-shaped address here — that is the
           * signature of "known device, unresolvable identity". */
          {
            char idStr[18], rpaStr[18];
            FS_BleDiag_FormatAddr(idStr, sizeof(idStr),
                p_enhanced_connection_complete_event->Peer_Address);
            FS_BleDiag_FormatAddr(rpaStr, sizeof(rpaStr),
                p_enhanced_connection_complete_event->Peer_Resolvable_Private_Address);
            FS_BleDiag_Log("CONN st=0x%02X role=%u handle=0x%04X ptype=%u paddr=%s",
                (unsigned) p_enhanced_connection_complete_event->Status,
                (unsigned) role, (unsigned) connection_handle,
                (unsigned) p_enhanced_connection_complete_event->Peer_Address_Type,
                idStr);
            FS_BleDiag_Log("CONN handle=0x%04X peer_rpa=%s int=%u to=%u",
                (unsigned) connection_handle, rpaStr,
                (unsigned) p_enhanced_connection_complete_event->Conn_Interval,
                (unsigned) p_enhanced_connection_complete_event->Supervision_Timeout);
          }
#endif

          if (role == 0x00)
          { /* ROLE CENTRAL */
        	  APP_DBG_MSG("-- CONNECTION SUCCESS WITH END DEVICE 1\n\r");
        	  BleApplicationContext.EndDevice_Connection_Status[0] = APP_BLE_CONNECTED;
        	  BleApplicationContext.connectionHandleEndDevice1 = connection_handle;
        	  FS_ActiveLook_Client_StartDiscovery(connection_handle);
          }
          else
          {
            APP_DBG_MSG("-- CONNECTION SUCCESS WITH SMART PHONE\n\r");
            BleApplicationContext.SmartPhone_Connection_Status = APP_BLE_CONNECTED;
            BleApplicationContext.connectionHandleCentral = connection_handle;

            /* Remember who this is, for the poisoned-bond self-heal at
             * disconnect. Types 0x02/0x03 mean the controller already resolved
             * a private address: Peer_Address then IS the identity, of type
             * public (0x00) or static-random (0x01) respectively — the same
             * form the bonding table stores. */
            central_id_type = p_enhanced_connection_complete_event->Peer_Address_Type;
            if (central_id_type >= 0x02)
            {
              central_id_type -= 0x02;
            }
            memcpy(central_id_addr,
                   p_enhanced_connection_complete_event->Peer_Address, 6);
            central_id_valid = 1;
            central_pair_ok = 0;
            central_conn_tick = HAL_GetTick();
            HandleNotification.Custom_Evt_Opcode = CUSTOM_CONN_HANDLE_EVT;
            HandleNotification.ConnectionHandle = connection_handle;
            Custom_APP_Notification(&HandleNotification);

            /* Stop the timer */
            HW_TS_Stop(Advertising_mgr_timer_Id);

            /* Call advertising callback */
            if (Adv_Callback) Adv_Callback();

            /* Update advertising callback */
            Adv_Callback = Next_Adv_Callback;
            Next_Adv_Callback = 0;

            /* Configure the link */
            UTIL_SEQ_SetTask(1 << CFG_TASK_LINK_CONFIG_ID, CFG_SCH_PRIO_1);
          }
          break; /* HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE */

        case HCI_LE_ADVERTISING_REPORT_SUBEVT_CODE:
          /* USER CODE BEGIN EVT_LE_ADVERTISING_REPORT */

          /* USER CODE END EVT_LE_ADVERTISING_REPORT */
          le_advertising_event = (hci_le_advertising_report_event_rp0 *) p_meta_evt->data;

          event_type = le_advertising_event->Advertising_Report[0].Event_Type;

          event_data_size = le_advertising_event->Advertising_Report[0].Length_Data;

          /* WARNING: be careful when decoding advertising report as its raw format cannot be mapped on a C structure.
          The data and RSSI values could not be directly decoded from the RAM using the data and RSSI field from hci_le_advertising_report_event_rp0 structure.
          Instead they must be read by using offsets (please refer to BLE specification).
          RSSI = (int8_t)*(uint8_t*) (adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data);
          */
          adv_report_data = (uint8_t*)(&le_advertising_event->Advertising_Report[0].Length_Data) + 1;
          k = 0;

          /*
           * ActiveLook command service UUID (little-endian):
           *   0783B03E-8535-B5A0-7140-A304D2495CB7
           * LE bytes: B7 5C 49 D2 04 A3 40 71 A0 B5 35 85 3E B0 83 07
           */
          static const uint8_t activelook_svc_uuid[16] = {
              0xB7, 0x5C, 0x49, 0xD2, 0x04, 0xA3, 0x40, 0x71,
              0xA0, 0xB5, 0x35, 0x85, 0x3E, 0xB0, 0x83, 0x07
          };

          /* Flags to track match within this advertising report */
          uint8_t foundUUID = 0;   /* ActiveLook service UUID found */
          uint8_t foundName = 0;   /* Name prefix "ENGO" found */
          char    candSerial[FS_ENGO_SERIAL_LEN + 1] = {0}; /* trailing 6 chars of name = ENGO serial */
          uint8_t haveSerial = 0;  /* candSerial is populated */
          char    candName[17] = {0};  /* advertised name, for the event log */

